ch02/documentstyle.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.6 in JDK 6. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.6 in JDK 6. --><definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ts.ch02/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ts.ch02/" name="TimeServerImplService">
<types>
<xsd:schema>
<xsd:import namespace="http://ts.ch02/" schemaLocation="http://localhost:9876/ts?xsd=1"></xsd:import>
</xsd:schema>
</types>
<message name="getTimeAsString">
<part name="parameters" element="tns:getTimeAsString"></part>
</message>
<message name="getTimeAsStringResponse">
<part name="parameters" element="tns:getTimeAsStringResponse"></part>
</message>
<message name="getTimeAsElapsed">
<part name="parameters" element="tns:getTimeAsElapsed"></part>
</message>
<message name="getTimeAsElapsedResponse">
<part name="parameters" element="tns:getTimeAsElapsedResponse"></part>

</message>
<portType name="TimeServer">
<operation name="getTimeAsString">
<input message="tns:getTimeAsString"></input>
<output message="tns:getTimeAsStringResponse"></output>
</operation>
<operation name="getTimeAsElapsed">
<input message="tns:getTimeAsElapsed"></input>
<output message="tns:getTimeAsElapsedResponse"></output>
</operation>
</portType>
<binding name="TimeServerImplPortBinding" type="tns:TimeServer">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
<operation name="getTimeAsString">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal"></soap:body>

</input>
<output>
<soap:body use="literal"></soap:body>
</output>
</operation>
<operation name="getTimeAsElapsed">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
</operation>
</binding>
<service name="TimeServerImplService">
<port name="TimeServerImplPort" binding="tns:TimeServerImplPortBinding">

<soap:address location="http://localhost:9876/ts"></soap:address>
</port>
</service>
</definitions>	